const IconModal = (props: any) => {
  const { width = '20px', height = '20px' } = props;
  return (
    <svg width={width} height={height} viewBox="0 0 20 20" version="1.1" xmlns="http://www.w3.org/2000/svg" >
      <g id="一期-主要界面" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
        <g id="首页-组件图片" transform="translate(-696, -532)">
          <g id="复选" transform="translate(696, 532)">
            <g id="编组-12" transform="translate(0, 0.4905)">
              <path d="M6.00162491,0.807990938 L7.74310218,3.00952148 L17,3.00952148 C17.6903559,3.00952148 18.3153559,3.28934352 18.767767,3.74175453 C19.220178,4.19416555 19.5,4.81916555 19.5,5.50952148 L19.5,16.5095215 C19.5,17.1998774 19.220178,17.8248774 18.767767,18.2772884 C18.3153559,18.7296995 17.6903559,19.0095215 17,19.0095215 L3,19.0095215 C2.30964406,19.0095215 1.68464406,18.7296995 1.23223305,18.2772884 C0.779822031,17.8248774 0.5,17.1998774 0.5,16.5095215 L0.5,5.50952148 C0.5,4.81916555 0.779822031,4.19416555 1.23223305,3.74175453 C1.68464406,3.28934352 2.30964406,3.00952148 3,3.00952148 L4.27449753,3.00952148 L6.00162491,0.807990938 Z" id="矩形" stroke="#777E8C"></path>
              <rect id="矩形" fill="#216EF7" x="6" y="8.50952148" width="8" height="1"></rect>
              <rect id="矩形备份-4" fill="#216EF7" x="6" y="12.5095215" width="8" height="1"></rect>
            </g>
          </g>
        </g>
      </g>
    </svg>
  );
};
export default IconModal;
